{
    "Semestre": "9",
    "Malla Renglon": "18",
    "Código del Espacio": "64",
    "Espacio Académico": "Inteligencia Computacional I",
    "Teórico": "",
    "Teórico-práctico": "X",
    "Práctico": "",
    "Número de Créditos": "3",
    "Horas Trabajo Directo": "4",
    "Horas Trabajo Colaborativo": "2",
    "Horas Trabajo Autónomo": "3",
    "Obligatorio": "",
    "Básico": "",
    "Complementario": "",
    "Electivo": "X",
    "Intríseco": "X",
    "Extrínseco": "",
    "Clase magistral": "x",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
    "Contenidos y Unidades Temáticas": "- Teoría de conjuntos y sistemas difusos\n- Aprendizaje supervisado en sistemas difusos\n- Aprendizaje no supervisado en sistemas difusos\n- Evolución de sistemas difusos.",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "",
    "Resultados de Aprendizaje": [
        "Resultado 1",
        "Resultado 2",
        "...",
        "Resultado n"
    ],
    "Proyecto curricular": "Ingenieria Electronic",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": "Según Fogel [1] la inteligencia computacional se define como el conjunto de técnicas computacionales y teorías que ven en la naturaleza una fuente de inspiración para resolver problemas. Hoy en día, la inteligencia computacional se encuentra soportada por las computaciones neuronal, difusa y evolutiva, al igual que los sistemas híbridos que las combinan o que combinan otros paradigmas relacionados con las mismas.\n La inteligencia computacional se ha convertido en una herramienta transversal que da soporte a una gran variedad de disciplinas, siendo entonces uno de los motores de investigación y desarrollo tecnológico más prometedores del mundo moderno. De hecho, la inteligencia computacional ha permitido que la creciente complejidad de los problemas se maneje de forma natural y en casos particulares de manera óptima. Se pueden citar algunos casos particulares con el fin de dar una idea del potencial de aplicación de este paradigma. Entre otros vale la pena mencionar: sistemas inteligentes de manufactura [2], hardware tolerante a fallas [3], modelado de la actividad del cerebro [4] y control inteligente de vehículos [5]\n Los procesos de diseño en ingeniería electrónica tienen que abordar la solución de problemas cuya complejidad crece cada día. Algunos problemas particulares que reafirman este enunciado entre otros son:\n  Diseño de antenas inteligentes y adaptativas con patrones de radiación óptimos [6].\n Diseño de redes inteligentes [7]\n Diseño de controladores adaptativos [8].\n Diseño de aplicaciones basadas en biometría [9]\nEl ingeniero electrónico moderno debe estar en capacidad de afrontar el estudio y solución de estos y otros problemas, donde la complejidad y la incertidumbre suponen mayores retos y dificultades. En ese sentido, las técnicas de inteligencia computacional se presentan como herramientas alternativas que permiten avanzar en la solución de los mismos. Así pues, el ingeniero electrónico de hoy debería ser conducido hacia el estudio de estas técnicas desde una perspectiva básica, de manera que autónomamente pueda profundizar en ellas o apropiarse de las mismas.\n Una exploración de programas académicos nacionales e internacionales en ingenierías eléctrica y electrónica [10-13] permite afirmar que en otros lugares de Colombia y el mundo se vienen dando pasos que avanzan hacia la integración de la enseñanza de la inteligencia computacional en los currículos de pregrado en ingeniería electrónica. Debe resaltarse que el estudio de la inteligencia computacional en estos programas se lleva a cabo por medio de cursos electivos en los últimos semestres, los cuales tienen un carácter de profundización.\n Particularmente, el curso de Inteligencia Computacional I, aborda el estudio de los SISTEMAS DIFUSOS. La teoría de los sistemas difusos busca emular la forma como los seres humanos desarrollan procesos de inferencia basados en la experiencia y el lenguaje [14]. Esta clase de sistemas permite adicionalmente modelar: la vaguedad [15] y ciertos fenómenos de naturaleza no lineal [16,17]. \n Particularmente dentro del contexto de la ingeniería electrónica, la aplicación de los sistemas difusos ha mostrado resultados interesantes en el tratamiento de problemas como: modelado de funciones y sistemas no lineales [16,17], control de procesos complejos y no lineales [14], ecualización de canales no lineales de comunicación [15], filtrado no lineal de imágenes [18] entre otros. \n Así pues, los sistemas difusos se pueden considerar como una herramienta transversal que le permitiría al ingeniero electrónico moderno proponer soluciones innovadoras a problemas en diferentes áreas. Igualmente, al ser una técnica fundamentada en la bio-inspiración ofrece un campo de exploración académico amplio para el ingeniero en formación. En ese sentido, el estudiante puede entrar a potenciar sus competencias en investigación, pensando en continuar hacia estudios de postgrado relacionados con inteligencia computacional.",
    "Objetivos":"OBJETIVOS GENERAL\n\nPresentar la teoría, diseño y aplicación de los sistemas difusos en relación con la computación evolutiva\n\n OBJETIVOS ESPECIFICOS\n\n- Presentar al estudiante las bases teóricas de los conjuntos y sistemas difusos.\n- Introducir al estudiante al diseño de sistemas difusos basado en experiencia.\n- Acercar al estudiante a los métodos de diseño de sistemas difusos basados en aprendizaje supervisado y no supervisado.\n- Acercar al estudiante a la evolución de sistemas difusos. \n- Mostrar al estudiante un marco aplicativo de los sistemas difusos en ingeniería.",
    "Competencias":"El espacio académico contribuye al desarrollo de las siguientes competencias:\n\nGenerales:\n- Analizar la incertidumbre en sistemas.\n- Profundizar autónomamente en nuevas temáticas.\n- Diseñar y construir herramientas para la solución de problemas.\n- Desarrollar métodos de diseño.\n- Formular, desarrollar y documentar proyectos de investigación.\n\nEspecificas:\n- Aplicar la inteligencia computacional como mecanismo para el tratamiento de la incertidumbre.\n- Proveer soluciones basadas en algoritmos de inteligencia computacional",
    "Metodologia":"",
      
  
    "recursos":"Para el desarrollo de los espacios académicos bajo la metodología sugerida anteriormente será necesario contar con medios audiovisuales, como por ejemplo Video-Beam y proyector de ntransparencias. Igualmente, el desarrollo la sesión cooperativa de taller demandará de una sala de informática dotada con un número suficiente de computadores, los cuales deberán contar con las plataformas software apropiadas para el desarrollo de los tópicos. \n Una plataforma software apropiada para el desarrollo de los espacios académicos en inteligencia computacional es MALTAB® de la empresa MATHWORKS inc con las toolboxes dedicadas para sistemas difusos, redes neuronales y algoritmos genéticos. Para el uso privado de los estudiantes se sugiere promover herramientas de software libre compatibles con MATLAB® , como por ejemplo SCILAB y OCTAVE. \nAula virtual en Moodle para el desarrollo de las actividades de trabajo autonomo y cooperativo. \nAcceso a bases de datos como IEEExplore, Science direct y ACM. ",
  
    "Resultados de Aprendizaje1":" Emplear la teoría de conjuntos y sistemas difusos ",
    "Resultados de Aprendizaje2":" Diseñar sistemas difusos basado en la experiencia ",
    "Resultados de Aprendizaje3":"Desarrollar sistemas difusos a través del algoritmo de retropropagación.  ",
    "Resultados de Aprendizaje4":"Desarrollar sistemas difusos a través del algoritmo de evolución diferencial. ",
    "Resultados de Aprendizaje5":"Evaluar el desempeño de sistemas difusos. ",
    "Resultados de Aprendizaje6":" ",
    
    "Materiales de Estudio": " [1] D. Fogel,” CIS welcome message from the President”, IEEE Computational Intelligence Society, 2008, http://ieee-cis.org/about_cis/\n[2] T. Fokuda and N. Kubota, “ Intelligent learning robotic systems using computational intelligence”, Computational Intelligence the experts speak, Wiley Inter-science, 2002, pp. 121-138.\n[3] T. Higuchi et al, “Evolvable hardware and its applications”, Computational Intelligence the experts speak, Wiley Inter-science, 2002, pp. 191-206\n[4] B. Balnkertz et al, “The Berlin Brain-Computer Interface”, Computational Intelligence:\nResearch Frontiers, Springer, 2008, pp. 79 -101\n[5] H. Hagras, “Type-2 Fuzzy Logic Controllers: A Way Forward for Fuzzy Systems in Real World Environments”, Computational Intelligence: Research Frontiers, Springer, 2008, pp. 79 -101\n[6] X. Huang , “Smart Antennas for Intelligent Transportation Systems”, 2006 6th International Conference on ITS Telecommunications Proceedings, 2006, pp 426-429\n[7] H. Nojeong and P Varshney, “Energy-efficient deployment of Intelligent Mobile sensor networks”, IEEE Transactions on Systems, Man and Cybernetics”, Jan. 2005,pp 78 – 92\n[8] T. Nguyen and R. Gianto ,”Neural networks for adaptive control coordination of PSSs and FACTS devices in multimachine power system”, IET 2008 Generation, Transmission & Distribution, May 2008, pp., 355 – 372\n[9] R. Sala et al, “Personal Identification Through 3D Biometric Measurements Based on Stereoscopic Image Pairs”, Proceedings of the 2006 IEEE International Workshop on Measurement Systems for Homeland Security, Contraband Detection and Personal Safety, 2006, pp. 10-13\n[10] Universidad de Antioquia, Plan de estudios del programa de ingeniería electrónica, http://electronica.udea.edu.co/.\n[11] Universidad del Valle, Plan de estudios del programa de ingeniería electrónica, https://swebse29.univalle.edu.co/datalinea//paquetes/catalogoasignaturas/index.php\n[12] University of Surrey, Electronic Engineering Programme Overview and Structure, http://www.surrey.ac.uk/undergraduate/courses/coursedetails.php?url=engineering/ electronic/programme\n[13] University of Melbourne, Bachelor of engineering program ( electrical engineering),https://app.portal.unimelb.edu.au/CSCApplication/view/2008/355-EE\n[14] L. X. Wang, A course on fuzzy systems and control, Prentice Hall, 1996.\n[15] J. Mendel, Uncertain Rule-Based Fuzzy Logic Systems, Prentice Hall, 2000.n[16] R. Babuska, Fuzzy Modeling for control , Kluwer Academics, 1998.n[17] C. Peña-Reyes, Evolutionary Fuzzy Modeling, Springer-Verlag, 2004.\n[18] M Nachtegae, Fuzzy filters for image processing, Springer Verlag, New York, 2003"
}