{

    "Proyecto curricular": "",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": "El interés de la Cátedra de Contexto está dirigido a la reflexión acerca de temas cruciales de Ciencia, Tecnología y Sociedad (CTS) en una visión de carácter filosófico y desde la filosofía de la ciencia. La temática de la CTS en la actualidad está influida por un inmenso debate acerca del programa o las líneas de acción que deben considerarse para lograr el desarrollo de un campo disciplinar propio, que por importancia relacione los temas de la ciencia, la tecnología y la sociedad como un todo, al incorporar el avance tecnológico. Sin embargo, los diferentes Congresos Internacionales que han buscado lograr ese hilo conductor no han logrado su cometido. Este es un aspecto que debe ser considerado a partir de varias posiciones: a) desde el campo desde la ingeniería el “conocimiento ingenieril” clásico hace que el ingeniero valore su actividad en la tecnología como vital y fundamental para la sociedad; b) desde la preocupación de las consecuencias del avance de la ciencia y la técnica están las preocupaciones de carácter social y la tendencia actual a incorporar el problema ecológico – ambiental y los aportes de sociólogos, economistas, psicólogos sobre repercusión tecnológica, y c) el aporte fundamental y tardío de la filosofía y las humanidades sobre las consecuencias sobre el sistema de valores, creencias, especialmente las consideraciones éticas.\n \nEn tal sentido curso se enfoca al debate de diversas posturas acerca de la incidencia de la tecnología de información y sus consecuencias económicas, políticas, filosóficas y sociales. Se trata de un curso que estudia y discute desde el conocimiento de la ingeniería la actividad tecnológica, y que involucra aspectos relacionados con los debates sociales en torno al desarrollo ambiental y la economía sostenible. Este curso tiene en cuenta textos, autores y temáticas que por su importancia marcan el curso y los debates actuales sobre Ciencia, Ingeniería y Sociedad (CTS) \nEl curso debe lograr el surgimiento de una conducta crítica y estructurada de los estudiantes, con capacidad para preguntarse acerca de los alcances de determinadas posturas de los individuos, el estado, organizaciones sociales y económicas, y desde un criterio ético de responsabilidad social favorecer su futura intervención frente a problemas de su quehacer como ingeniero, alrededor de problemas como son la desigualdad social, el irrespeto a las personas, la riqueza, la introducción de tecnologías, etc.",
    "Objetivos":"OBJETIVOS GENERAL\n\nLa Cátedra de Contexto, debe propiciar un espacio reflexivo sobre temas cruciales, que inciden en la mentalidad del ingeniero y promover el debate de temas que son de trascendencia científica, tecnológica y social. El objetivo general estará centrado en la idea de promover el debate académico en torno a temas relacionados con el fundamento científico y social de la Universidad Distrital “Francisco José de Caldas” que son determinantes en el quehacer científico y tecnológico.\n\nOBJETIVOS ESPECIFICOS\n\n1. Búsqueda de espacios que permiten al ingeniero comprender y analizar diversos problemas que plantea la ciencia y la tecnología contemporáneas, para distinguir con claridad aspectos cruciales más allá de los de tipo interno propios de una reflexión clásica.\n2. Estructurar en forma coherente y argumentativa la heterogeneidad de temas y problemas que en la actualidad se debaten bajo la denominación de Ciencia, Tecnología y Sociedad (CTS) o Filosofía de la Tecnología.\n\n",
    "Competencias":"BASICAS\nComprender los problemas del avance y la innovación tecnológica sobre la sociedad. Reconocer el significado e importancia de los conceptos derivados de la reflexión contextual sobre Tecnología y su aplicación con propiedad en la ingeniería. Fortalecer los valores del ingeniero como persona y comprender su relación con las soluciones que este aporta a la sociedad.\nAdquirir competencias de análisis, síntesis, comparación, argumentación, inducción, deducción, capacidad de observación, formulación de hipótesis, de graduación cualitativa, honestidad intelectual, etc., en los procesos de aprendizaje, reflexión e investigación en su formación sobre la incidencia de la técnica en la sociedad.\nLograr desarrollar un pensamiento crítico distinguiendo los hechos relevantes de los secundarios. Los principios básicos de su formación le permitirán comprender e interpretar los distintos fenómenos sociales y el aporte de soluciones.\nDesarrollarse como persona en su vocación de ingeniero. Ponderar las consecuencias de la introducción de tecnología y los riesgos derivados. Estará en capacidad para relacionar su aprendizaje con la realidad del mundo globalizado.\nTendrá capacidad para identificar y analizar los problemas que plantea la materia y podrá relacionarlos con su contexto económico, político, histórico y cultural. Además, comprenderá el carácter problema ético que subyace involucrado en la introducción de tecnología.\nTendrá capacidad para identificar y analizar los problemas éticos y tecnológicos de la ingeniería en su contexto histórico y cultural. Analizará críticamente los diversos textos y doctrinas propuestas en materia de ética. Valorará positiva las diversas corrientes acerca del quehacer de la tecnología para comprender su alcance.\nPodrá comunicarse efectiva y asertivamente a través de un discurso tejido sobre argumentos convincentes, racionales y concisos, además desarrollará la competencia y actuación lingüística - lengua y habla – como instrumentos de pensamiento. Tendrá capacidad para argumentar y debatir problemas propios de su reflexión acerca de la importancia e incidencia de la tecnología, respetando la libertad de expresión y las opiniones ajenas.\nPoseerá habilidad de análisis y síntesis. Manejara hábilmente la información proveniente de fuentes diversas. Desarrollará habilidades y destrezas relacionadas con la producción de textos e informes de acuerdo con metodología de investigación.\nA través del curso entenderá los alcances de su dimensión personal como ingeniero y con la sociedad que le rodea de manera crítica.\nLABORALES\nAdemás, de las propias competencias de su carrera, el curso de Contexto le servirá para lograr una visión integradora de conocimientos que le permitirá en su vida profesional dirigir y desarrollar proyectos de investigación con sentido relacionados con el uso y la innovación tecnológica.\nParticipar activamente en equipos multidisciplinarios y será capaz de trabajar como ingeniero en contexto internacional.",
    "Metodologia":"Metodología Pedagógica y Didáctica: \nLos temas se desarrollan mediante conferencias magistrales y lecturas seleccionadas para la discusión en clase. Las discusiones se realizan mediante la técnica de un seminario dirigido destinado a permitir interactuar y argumentar por el estudiante sobre los diferentes problemas planteados. En este contexto se seleccionarán estudiantes quienes expondrán temas específicos definidos y señalados en la bibliografía referencial por el profesor, correspondiendo a los estudiantes del curso participar en las exposiciones y debates.\nEn general se debe referenciar el modelo didáctico y pedagógico al cual se suscribe la propuesta de Syllabus.",
    
    "Semestre": "6",
    "Malla Renglon": "9",
    "Código del Espacio": "40",
    "Espacio Académico": "Cátedra de Contexto",
    "Teórico": "X",
    "Teórico-práctico": "",
    "Práctico": "",
    "Número de Créditos": "1",
    "Horas Trabajo Directo": "2",
    "Horas Trabajo Colaborativo": "0",
    "Horas Trabajo Autónomo": "1",
    "Obligatorio": "X",
    "Básico": "",
    "Complementario": "X",
    "Electivo": "",
    "Intríseco": "",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
    "Contenidos y Unidades Temáticas": "Unidad 1: Delimitación del ámbito de los estudios de Ciencia, Tecnología y Sociedad y su relación con los problemas de la Filosofía de la Ciencia.\n Unidad 2: Análisis de las tradiciones históricas y de los principales representantes en los estudios de CTS.\n Unidad 3: Perspectivas de algunos representantes.\n Unidad 4: Las relaciones entre Filosofía de la Tecnología y CTS.",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "Se espera un trabajo constante y riguroso de los participantes que será evaluado mediante la presentación de ensayos, que deberán ajustarse a las secciones del programa, de acuerdo con la bibliografía y textos que se recomienden. Interacción y participación del profesor y alumnos en talleres, discusión grupal y aportes individuales, a través de la metodología del seminario alemán. Los estudiantes discutirán en grupos algunos temas de interés. Un aspecto importante será la presentación de un ensayo final de la materia el cual debe consultar la bibliografía referencial a partir del cual se deberá elaborar cuidadoso análisis ajustado al tema seleccionado. Las evaluaciones comprenden cuatro (4) pruebas (incluido la final), participación en clase y asistencia, con un valor de 25% cada uno. Ajuste por curva de la nota a aquellos participantes con un 75% de asistencia al curso. \nASPECTOS A EVALUAR DEL CURSO:\n1. Evaluación del desempeño docente\n2. Evaluación de los aprendizajes de los estudiantes en sus dimensiones: individual/grupo, teórica/práctica, oral/escrita.\n3. Autoevaluación.\n4. Coevaluación del curso: de forma oral entre estudiantes y docente.",

    "Resultados de Aprendizaje1":"1. Conocer de que tratan los estudios de Ciencia, Tecnología y Sociedad y como se relacionan con los problemas de la filosofía de la ciencia y la filosofía de la tecnología.",
    "Resultados de Aprendizaje2":"2. Argumentar de forma constructiva desde una perspectiva contemporánea la relación entre desarrollo científico y tecnológico, desarrollo económico y desarrollo social.",
    "Resultados de Aprendizaje3":"3. Cuestionar de forma constructiva las contribuciones de los principales representantes del Movimiento Internacional de Ciencia, Tecnología y Sociedad.",
    "Resultados de Aprendizaje4":"4. Comunicar de forma asertiva a través de la escritura, el habla y de forma visual, utilizando diversas herramientas tecnológicas.",
    "Resultados de Aprendizaje5":"",
    "Resultados de Aprendizaje6":"",
    
    "Materiales de Estudio": ""
}