{
    "Proyecto curricular": "",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": "Las competencias del perfil a las que contribuye la asignatura son: \n Las comunidades académicas, científicas, de profesionales y de investigación tienen la necesidad de utilizar adecuadamente las habilidades comunicativas en forma oral, escrita y audiovisual para expresar coherentemente sus trabajos académicos y proyectos. Por lo tanto, deben conocer los procesos comunicacionales, las estructuras de los diversos discursos acorde con las exigencias crecientes del entorno académico, científico, laboral y de las organizaciones civiles, sociales y políticas.",
    "Objetivos":" OBJETIVO GENERAL \n Fortalecer las competencias comunicativas de los estudiantes de Primer Semestre del Proyecto Curricular de Ingeniería Electrónica para potenciar su proceso de aprendizaje y el manejo del lenguaje como vehículo para la interacción social y del desarrollo humano.\n\nOBJETIVOS ESPECIFICOS \n1. Facilitar procesos de formación integral para el desarrollo humano (proyecto de vida, sentido de pertenencia y capacidad de adaptación a nuevos estilos de vida) para promover la formación en valores del estudiante no sólo como individuo, miembro de la sociedad, sino también como profesional de la ingeniería. \n 2. Incrementar de lectura, escritura y expresión oral para fortalecer los procesos de comunicación. \n 3. Conceptualizar y aplicar las diferentes estrategias de comunicación y métodos de estudio como herramientas para afianzar los procesos de aprendizaje. \n 4. Movilizar en el estudiante el aprecio por el ejercicio de la lectura como parte decisiva de su formación profesional y personal; esto es, analizar diversas actitudes hacia la lectura e identificar obstáculos que impidan asumirla como un ejercicio gratificante. \n 5. Fortalecer la práctica de la lectura y la escritura mediante el análisis y la comprensión de textos, que permitan a su vez el desarrollo de habilidades comunicativas. \n 6. Desarrollar la conciencia de equipo para saber y querer complementarse con los demás, coordinando personalidades y actividades.",
    "Competencias":"Promover la participación, exigiéndole al estudiante ser el protagonista activo y responsable de su aprendizaje y su formación, bajo la filosofía de que el aprendizaje adquiere mayor significación y resonancia en el estudiante, si éste vive su propio proceso de construcción, es decir, la aplicación del método constructivista, donde se concibe la enseñanza como una actividad crítica en el que los estudiantes interactúan y exploran, aprenden a arriesgarse y a errar; tomándose este último como un proceso de aprendizaje en el que los errores cometidos son situaciones didácticas que deben considerarse como momentos creativos.",
    "Metodologia":" Las actividades a desarrollar son: \n  Breves exposiciones orales por parte de los estudiantes \n Lectura, análisis y discusión colectiva, en el aula de textos producidos por otros autores \n Asesoría grupal sobre problemas de escritura y expresión oral \n Ejercicios de producción articulados con los objetivos y demandas de los textos en los que los estudiantes están trabajando \n Escritura, reescritura, corrección y autocorrección de textos (proyectos personal y colectivo) \n Los aspectos formales del trabajo de escritura (cohesión, coherencia, estructura de párrafos, morfosintaxis, puntuación y ortografía) serán abordados según las necesidades percibidas en los textos de los estudiantes.",
    
    
    
    
    "Semestre": "1",
    "Malla Renglon": "10",
    "Código del Espacio": "5",
    "Espacio Académico": "Producción y Comprensión de Textos",
    "Teórico": "X",
    "Teórico-práctico": "",
    "Práctico": "",
    "Número de Créditos": "2",
    "Horas Trabajo Directo": "2",
    "Horas Trabajo Colaborativo": "2",
    "Horas Trabajo Autónomo": "2",
    "Obligatorio": "X",
    "Básico": "",
    "Complementario": "X",
    "Electivo": "",
    "Intríseco": "",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
    "Contenidos y Unidades Temáticas": "",
    "Enfoque de Aprendizaje y Enseñanza": "Promover la participación, exigiéndole al estudiante ser el protagonista activo y responsable de su aprendizaje y su formación, bajo la filosofía de que el aprendizaje adquiere mayor significación y resonancia en el estudiante, si éste vive su propio proceso de construcción, es decir, la aplicación del método constructivista, donde se concibe la enseñanza como una actividad crítica en el que los estudiantes interactúan y exploran, aprenden a arriesgarse y a errar; tomándose este último como un proceso de aprendizaje en el que los errores cometidos son situaciones didácticas que deben considerarse como momentos creativos.",
    "Plan de Evaluaciones": "La filosofía de la evaluación se define por el principio del estímulo al trabajo realizado y no por el principio del castigo a las faltas en el mismo. Es así como el error en los diferentes talleres o la entrega de trabajos poco elaborados, se consideran materia prima para continuar el proceso, teniendo siempre presente la actitud del estudiante, el compromiso, el esfuerzo, la motivación, o por el contrario la apatía o poca disposición que evidencie en su trabajo. La evaluación gratificante es esencial para la creación de una cultura investigativa, ya que ante los errores aparece la pregunta, la posibilidad de retomar un tema para alcanzar mayor comprensión. Se trata de crear el hábito del trabajo, de preguntarse, de dudar, de buscar causas y efectos; no de juzgar o descalificar como forma de obturar un proceso de aprendizaje significativo. No se puede perder de vista que la evaluación apunta en todo momento a la formación de los estudiantes, no simplemente a la expresión de una nota en términos de aprobar o reprobar un curso; en este sentido, la evaluación se fundamenta en la rigurosidad y en el compromiso ético que requiere acompañar la formación de cada estudiante, privilegiando el proceso y no solamente los resultados, procurando que el método de evaluación empleado sea coherente y forme parte del método de enseñanza con que se trabaja en la cátedra, teniendo en cuenta que el aprendizaje, como la vida misma, es un proceso de construcción y deconstrucción permanente e inagotable",
    "Resultados de Aprendizaje1":"Abarca varios niveles dentro de la taxonomía de Bloom:\nConocimiento:\nRecordar las normas de ortografía generales del idioma.\nListar los propósitos de los signos de puntuación.\nIdentificar las diferentes técnicas de edición de texto matemático (Latex, por ejemplo).",
    "Resultados de Aprendizaje2":"Comprensión:\nDescribir los diferentes tipos de documentos técnicos propios de la ingeniería: reseñas,\n informes, reportes, ponencias, artículos, manuales, libros técnicos.\nReconocer a la lectura como el medio de adquisición de nuevo conocimiento.",
    "Resultados de Aprendizaje3":"Aplicación:\nConstruir una presentación oral con ayuda de material audio-visual.\nEmplear plantillas técnicas para la construcción de ponencias para eventos o artículos para publicaciones periódicas.",
    "Resultados de Aprendizaje4":"Análisis:\nExaminar los diferentes conceptos estudiados en diferentes tipos de documentos.\nDistinguir la relación entre los fenómenos de la naturaleza y los modelos que los representan.",
    "Materiales de Estudio": "ARBOLEDA, Rubén. Taller para el desarrollo de la lectura y la escritura. Bogotá: Unisur, 1985.\nBARBERO-MARTÍN, J. y SILVA, Armando. (Comp.) Proyectar la comunicación. Tercer Mundo, Santafé de Bogotá, 1997. Estructuras sintácticas, Buenos Aires, Siglo XXI, 1999.\nTransformaciones del saber en la sociedad del conocimiento y del mercado En: Revista de pensamiento contemporáneo, No. 7, 2001, págs. 7-13.\nBAJTÍN, Mijail. Arte y responsabilidad. En: Estética de la creación verbal. México: Siglo XXI Editores, 1999, págs.: 11-12.\nBAUDRILLARD, Jean. Cultura y simulacro. Barcelona. Editorial Kairós, 1978.\nBOLÍVAR BOTIA, Antonio. El estructuralismo: de Lévi-Strauss a Derrida. Editorial Cincel, Madrid, 1985, 215 págs.\nCHOMSKY, Noam. Aspectos de la teoría de la sintaxis, Barcelona, Gedisa, 1999.\n--------. El lenguaje y el entendimiento, Barcelona, Seix-Barral, 1977.\n--------. Lingüística cartesiana, Madrid, Gredos, 1972.\n--------. Reflexiones sobre el lenguaje, Barcelona, Ariel, 1979.\n--------. Los guardianes de la libertad. Barcelona: Editorial Crítica, 1990.\nCASSANY, Daniel. La cocina de la escritura. Anagrama, 1995.\nCEDAR, Paul. 7 claves de la argumentación. Paidós, 1986.\nDE AGUIAR E. SILVA, Víctor. Teoría de la literatura. Editorial Gredos, 1972, págs. 12-42; 44-102.\nVAN DIJK, Teun. Texto y contexto. Semántica y pragmática del discurso. Ediciones Cátedra, Madrid, 19 La noticia como discurso. Comprensión, estructura y producción de la información.\n--------. Estructura y funciones del discurso. Paidós, Barcelona, 1980.\nICFES. Metodología y estrategias de la educación superior abierta y a distancia. Bogotá, ICFES, 1983, Págs: 24-30; 70-72;\nLOTMAN, Yuri. Estructura del texto artístico. Ediciones Istmo, Madrid, 1988, págs.: 9-46.\nFERNÁNDEZ DE LA TORRE, Gastón. Cómo hablar en público. Bogotá, Editorial Norma, 1993.\nMcENTEE, Eileen. Comunicación oral para el mundo moderno. MacGraw Hill, 1996.\nNIÑO ROJAS, Víctor Miguel. La fuerza ilocutiva en el discurso. En: Los procesos de la comunicación y el lenguaje. Bogotá: ECOE, Ediciones, 1998, págs.: 46-54.\nPARRA, Marina. Cómo se produce el texto escrito: teoría y práctica. Bogotá: Editorial Magisterio, 1994.\nPINEDA TORRES, Ana Yamile. Formación de escritores: Elaboración de reseñas. Bogotá, Universidad Nacional, 2004.\nPERELLMAN, Chaim. El imperio retórico: retórica y argumentación. Barcelona, Norma:2003\nSEARLE, John R. (2004), Lenguaje y ciencias sociales: diálogo entre John Searle y Crea, ElRoure Editorial."
}
