{
    "Semestre": "10",
    "Malla Renglon": "17",
    "Código del Espacio": "74",
    "Espacio Académico": "Televisión Digital",
    "Teórico": "",
    "Teórico-práctico": "X",
    "Práctico": "",
    "Número de Créditos": "3",
    "Horas Trabajo Directo": "4",
    "Horas Trabajo Colaborativo": "2",
    "Horas Trabajo Autónomo": "3",
    "Obligatorio": "",
    "Básico": "",
    "Complementario": "",
    "Electivo": "X",
    "Intríseco": "X",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": " (Telecomunicaciones I 508401)1. \nConocimientos básicos de Campos y Ondas electromagnéticas\n    2. Antenas \n    3. Conocimientos básicos de Física de Semiconductores.\n    4. Dominio de la teoría de análisis y diseño de circuitos.\n    5. Conocimientos básicos en Telemática.\n    6. Conocimientos básicos de Telecomunicaciones\n    7. Conocimientos básicos de Televisión Analógica\n    8. Conocimientos básicos en Procesamiento digital de Señales\n    9. Conocimientos básicos de inglés.\n    10. Conocimientos básicos de CAE (como MathCAD, MATLAB (SIMULINK), PROTEUS, LTSPICE, MULTISIM, CMAPTOOLS, EXCEL, LINUX,\n    LATEX, PYTHON etc.)\n    11. Conocimientos fundamentales de Comunicación Mediada por Computador (correo electrónico, Chat, navegadores Web, motores de búsqueda,\n    plataforma MOODLE, Classroom, etc.),",
    "Es prerrequisito de": " (Telecomunicaciones I 508401",
    "Contenidos y Unidades Temáticas": "PROGRAMA SINTÉTICO: \n    1. Introducción a los Sistemas de Televisión. La Luz, Aspectos perceptuales de la visión humana, relación de aspecto.\n    2. Cámaras, sistema óptico, CCD, imagen, video compuesto, Y, Cb, Cr. Digitalización de la señal de video\n    3. ITU-R BT.601. Multiplexación, Transmisión\n    4. Muestreo, Cuantificación, Compresión, fundamentos MPEG-2/4. Codificación\n    5. TV analógica Terrestre, Televisión Digital Terrestre TDT. SFN. Características DVB-T y DVB-T2\n    6. Interfaces TV analógicas y digitales. Receptores TV, monitores y pantallas: LCD, PLASMA, LED OLED, QLED, 4K y 8K\n    7. Grabación y almacenamiento de señales de televisión digital\n    8. Aspectos perceptuales de la audición humana y manejo de la señal de audio digital\n    9. Análisis de la normatividad nacional e internacional en el campo de la televisión digital\n    10. Proyecto de integración para examen fina",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "",

    "Proyecto curricular": "",
  "Plan de Estudios": "",
  "Nombre del docente": "",
  "Justificacion Del Espacio": "La evolución de los sistemas de televisión digital son el resultado de la unión de la tecnología de la televisión convencional y la tecnología informática. En el dominio \n  digital, la información de video no se encuentra representada por las variables físicas, como lo son el voltaje de luminancia y crominancia, sino por dígitos binarios \n  que son el resultado del proceso de muestreo, cuantificación, codificación y compresión generados desde la forma compuesta o por componentes de la señal de video. \n  La señal de Televisión se encuentra compuesta de la señal de video y el audio asociado a éste. En el entorno del centro de producción la señal de televisión digital \n  debe manejarse con la máxima calidad propuesta por la Recomendación UIT-R-BT-601 designada como 4:2:2. Y, compresión (MPEG2/4), redundancia temporal, espacial\n  y estadística, aplicando los conceptos de transformada del coseno, entropía, códigos BCH, Reed Solomon, Hamming y convolución, emisión de audio (Dolby, AC3) y para \n  transmisión se modula en QAM, OFDM y COFDM, utilizando filtros digitales (coseno alzado), La transmisión digital se ofrece: terrestre DVB-T, cable DVB-C y satélite DVB-S. \n  Contemplando Multiplexación, Mapping, Viterbi y Trellis, constelaciones, FEC, BER, MER, alta definición (HD), además modelos como IPTV, streaming, 4K, 8K y 3D. Los \n  dispositivos de recepción y visualización de la televisión digital se extienden a pantallas (LCD, OLED, QLED), Smart TV, ipads y dispositivos móviles. Dichas razones son por las \n  cuales es necesario la construcción de un espacio académico en el cual el estudiante se aproxime al contexto de los equipos electrónicos que manejan los nuevos conceptos en el \n  campo de la televisión digital",
  "Objetivos":"OBJETIVOS GENERAL\n\nProporcionar al estudiante los conocimientos básicos relacionados con los sistemas de Televisión Digital, partiendo del proceso de generación de las señales de audio, video y\n  data, su tratamiento análogo-digital, el análisis de la física, la algoritmia y las matemáticas para flujos de datos multiplexados. La asignatura incluye, además, prácticas de\n  laboratorio que permiten al alumno familiarizarse con los aspectos fundamentales de la televisión digital\n OBJETIVOS ESPECIFICOS\n\n▪ Estudiar los criterios básicos de: características de la visión humana, definición de imagen y calidad de imagen.\n  ▪ Evaluar los fundamentos de la digitalización de las señales de video y audio\n  ▪ Considerar las propiedades de la compresión digital de audio y video\n  ▪ Analizar los intereses sobre el espectro electromagnético, las ventanas de VHF y UHF para televisión digital\n  ▪ Ilustrar sobre los estándares para televisión digital\n  ▪\n  Examinar la tecnología de modulación para señales digitales de audio y video.\n  ▪\n  Asimilar los principios de almacenaje y transmisión de televisión digital. ",
  "Competencias":"COMPETENCIAS DE FORMACIÓN:\n  (Estas competencias planteadas en los reglamentos de la Universidad Distrital Francisco José de Caldas, son: de contexto (culturales: del entorno natural y social\n  centrada en la autonomía de los individuos), básicas (cognitivas: en torno a la resolución de problemas e implica las tres del ICFES: interpretación, argumentación,\n  y proposición-), laborales (que facultan para desempeños de las profesiones). Las competencias se integran en estándares mínimos de calidad que permitan las\n  transferencias y homologaciones.\n  Al finalizar el curso se espera que el estudiante haya desarrollado las siguientes competencias:\n  Competencias de contexto\n  1. Comprensión del contexto social, cultural y económico.\n  2.  Valoración del trabajo productivo.\n  Competencias básicas\n  3.  Habilidad comunicativa (interpretativa, comunicativa y propositiva).\n  4.  Comprensión de textos en una segunda lengua.\n  5.  Pensamiento crítico y analítico.\n  6.  Pensamiento lógico-espacial.\n  7.  Capacidad para modelar fenómenos y procesos",
  "Metodologia":"a. La asignatura se imparte a través de clases magistrales y conferencias, en español y en inglés mediante la utilización de recursos del aula, material impreso y  electrónico, videobeam, software de simulación y consultas en el World Wide Web (Internet) y diapositivas. Utilizándose la pizarra para la resolución de ejemplos y problemas.\n  b. La parte del receptor de televisión se impartirá mediante la utilización de los diagramas eléctricos, mientras que para el resto del temario se trabajan metodologías de  aprendizaje activo como PBL (aprendizaje basado en problemas) y AC (aprendizaje corporativo)\n  c. En la parte práctica de la asignatura se formulan metodologías de aprendizaje activo como: trabajo en grupo y aprendizaje mediante la elaboración y sustentación de  proyectos por grupos. d. El proceso es altamente cognoscitivo necesario para el logro de los objetivos propuestos.\n  e. La aplicación y práctica de la ingeniería de televisión digital se hace a través de un trabajo continuo con acompañamiento del docente dentro y fuera de clase,\n  motivando el trabajo independiente del alumno que debe mantener un contacto permanente con el entorno tecnológico disponible.\n  f.La socialización de estas experiencias en el grupo, son el complemento del proceso de aprendizaje dado por la metodología que es coherente con la estructura del\n  contenido.\n  g. El facilitador solicita a los estudiantes lectura previa a cada clase del material de referencia.\n  h. Soporte del curso, a nivel de contenido y gestión en la WEB, con énfasis en aprendizaje significativo y colaborativo mediante mapas MENTALES y conceptuales\n  elaborados por los estudiantes.\n  i. Motivación de consultas intensivas y diversas de material en Internet, revistas, textos clásicos y afines, así como exposiciones y actividades didácticas sobre los\n  mismos por parte de los alumnos, en forma individual y grupal. Es indispensable que algunos temas del curso se desarrollen o profundicen por cuenta del estudiante.\n  j. El facilitador presentará lecturas y conversación básica en inglés sobre los temas propuestos en clase.\n  k. Motivación sobre la importancia de la formación físico-matemática en el pensamiento del ingeniero.\n  l. Presentación de normatividad y fomento de la comunicación escrita para la publicación, en formato de artículos, en revistas, como mecanismo para dar a conocer los proyectos, habilidades y saber de los estudiantes.",
    



  "Resultados de Aprendizaje1":"Interpretar la parte racional y explicativa de la Televisión Digital. ",
  "Resultados de Aprendizaje2":"Evaluar las estrategias del flujo de datos multiplexados.",
  "Resultados de Aprendizaje3":"Aplicar los conceptos y teorías relativos al almacenamiento de la señal de Televisión Digital. ",
  "Resultados de Aprendizaje4":"Asociar y deducir lo que constituye la codificación de fuente y proceso de la señal de Televisión Digital.  ",
  "Resultados de Aprendizaje5":"Diseñar, crear, analizar y validar estudios de televisión digital, estaciones de TDT y sistemas de propagación en transmisión-recepción de enlaces de microondas para televisión digital. ",
  "Resultados de Aprendizaje6":" ",
  
  "Materiales de Estudio": "1. Sistemas analógicos y digitales de televisión. L.Torres Urgell y otros. UPC. 1993. \n  2. Televisión Práctica y Sistemas de Video. B.R. Grob. Alfaomega. 2003. \n  3. Television engineering handbook. Benson, K.B. McGraw Hill, 1986. \n  4. Colour television. Hutson, G. Sheperd, P. Brice, J. McGraw Hill, 1990. \n  5. Digital television. Sandbank, C.P. John Wiley, 1990.\n  6. Televisión Digital Avanzada. Simonetta José. Intertel. 2002\n  7. La televisión digital, Fundamentos y Teorías, Manuel Cubero, Marcombo, 2009\n  8. Engineering Handbook. National Association of Broadcasters. NAB. 2007\n  9. Digital video and audio broadcasting technology, A practical engineering guide, Walter Fischer, Springer 2008"
}
