{
    "Semestre": "7",
    "Malla Renglon": "9",
    "Código del Espacio": "43",
    "Espacio Académico": "Hombre Sociedad y Ecologia",
    "Teórico": "X",
    "Teórico-práctico": "",
    "Práctico": "",
    "Número de Créditos": "1",
    "Horas Trabajo Directo": "2",
    "Horas Trabajo Colaborativo": "0",
    "Horas Trabajo Autónomo": "1",
    "Obligatorio": "X",
    "Básico": "",
    "Complementario": "X",
    "Electivo": "",
    "Intríseco": "",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
    "Contenidos y Unidades Temáticas": "● Unidad 1: Generalidades\n    Conceptos de Ecología, Economía, ambiente, mercado. \n    Aplicaciones y Proyectos. \n    Teoría general de Sistemas. \n    El lenguaje y los tecnicismos del discurso ecológico- ambiental. \n    ● Unidad 2: Gestión de ecosistemas\n    Poblaciones y comunidades. Diversidad. \n    Ecosistemas estratégicos. \n    Biodiversidad\n    ● Unidad 3: Políticas y ambientalismo\n    Interacciones en la comunidad. \n    Competencia.\n    Depredación Industria (Sistemas productivos) y medio ambiente.",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "",
    "Resultados de Aprendizaje": [
        "Resultado 1",
        "Resultado 2",
        "...",
        "Resultado n"
    ],
    "Proyecto curricular": "",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": "Las competencias del perfil a las que contribuye la asignatura son:\nBajo las condiciones actuales, con las transformaciones económicas, los cambios climáticos, el aumento de la población y la globalización, se hace necesario introducir a los estudiantes en el estudio de los fundamentos de la Ecología como ciencia socioeconómica dentro de un marco sistémico y auto- sostenible. Dentro de un contexto nacional e internacional el estudiante estará en capacidad de comprender los tratados internacionales, las regulaciones del medio ambiente y la vivencia crítica de casos colombianos de sistemas sociales y ecológicos a partir del uso de los elementos propios de la TGS Teoría General de Sistemas",
    "Objetivos":"OBJETIVOS GENERAL\n\nDebatir con los estudiantes sobre las políticas nacionales e internacionales sobre ecología y medio ambiente, donde los referentes teóricos se combinan con una práctica académica, manifiesta en una salida de uno o dos días a distintos lugares del país.\n\n OBJETIVOS ESPECIFICOS\n\n1. Generar elementos propios de la economía a partir de un análisis estructural de su desarrollo histórico.\n2. Realizar una aproximación a los debates propios de la globalización en el entorno del pensamiento ingenieril y ambiental.\n3. Aportar elementos de interpretación para abordar problemáticas propias de nuestro contexto.\n4. Generar conciencia sobre la necesidad de la preservación de los distintos ambientes",
    "Competencias":"",
    "Metodologia":"Es el estudiante quien va construyendo el conocimiento como resultado de la interacción de sus disposiciones internas y su medio social. Este conocimiento no debe ser una copia de la realidad, sino una construcción de la persona misma. A través de los procesos de aprendizaje el estudiante construye estructuras, es decir formas de organizar la información, las cuales facilitan el aprendizaje futuro. Esas estructuras son las representaciones organizadas de la experiencia previa, relativamente permanentes y sirven como esquemas que funcionan, para activamente, filtrar, codificar, categorizar y evaluar la información que uno recibe en relación con una experiencia relevante. El conocimiento debe ser un producto de la interacción social y de la cultura donde todos los procesos psicológicos se adquieren primero en un contexto social, se internalizan y luego se externalizan asignándole un significado y una objetivización. (Chadwick, Clifton, 1999). ",
      
  
  
  
    "Resultados de Aprendizaje1":" Identificar los conceptos generales de ecología. ",
    "Resultados de Aprendizaje2":" Identificar ecosistemas que hacen parte del país, y reflexionar sobre la preservación de los mismos. ",
    "Resultados de Aprendizaje3":" Reconocer la biodiversidad de Colombia y el impacto del hombre. ",
    "Resultados de Aprendizaje4":"Describir interacciones de la comunidad y el medio ambiente, problemáticas y soluciones. ",
    "Resultados de Aprendizaje5":" ",
    "Resultados de Aprendizaje6":" ",
    
    "Materiales de Estudio": "\n Aguado Alonso, J. Los residuos peligrosos: caracterización, tratamiento y gestión. Madrid: Síntesis, 1999. ISBN 8477387036. \n Masters, Gilbert M. Introducción a la ingeniería medioambiental. Madrid: Prentice-Hall, \n 2008. ISBN 9788483224441. \n Wark, Kenneth. Contaminación del aire: origen y control. México: Limusa, 1990. ISBN 9681819543. \n Masoliver, Dolors. Guía práctica para la implantación de un sistema de gestión ambiental. Barcelona: Departament de MediAmbient, 2000. ISBN 8439353057. \n Max-Neef, Manfred A. Desarrollo a escala humana: conceptos, aplicaciones y algunas reflexiones. Montevideo: Nordan Comunidad, 1993. ISBN 9974420059. \n Novo, María. El desarrollo sostenible: su dimensión ambiental y educativa. Madrid: Pearson Educación, 2006. ISBN 9788483223550. \n Orozco, Carmen. Contaminación ambiental: una visión desde la química. Madrid: International Thomson, 2003. ISBN 8497321782. \n Sawyer, Clair N. Química para ingeniería ambiental. 4a ed. Bogotá: McGraw-Hill, 2001. ISBN 9584101641. \n Tchobanoglous, George. Gestión integral de residuos sólidos. Madrid: McGraw-Hill, 1994.ISBN 8448118308"
}