{

    "Proyecto curricular": "",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": "Las competencias del perfil a las que contribuye la asignatura son:\nLa sociedad colombiana se ve enfrentada a diferentes problemas que inciden sobre la vida social. Los relacionados con la esfera económica, social y política, gravitan sobre ella condicionando la apertura de su desarrollo y la reducción de las diferentes brechas de dependencia: social, cultural, política, económica. Por esta razón se hace importante conocer como una variada temática afecta la organización económica, social y política. El objetivo del curso se centra en analizar y evaluar estos hechos desde diferentes perspectivas, y ofrecer a los estudiantes una visión moderna y contemporánea acerca del modo de superar la coyuntura social y transformar los factores estructurales que afectan la realidad colombiana. El estudiante se acercará a los temas a partir de diferentes autores que esbozan la realidad colombiana y desde allí tendrá una visión integral que le permite profundizar el quehacer nacional.",
    "Objetivos":"OBJETIVO GENERAL\n Brindar al estudiante una comprensión del entorno en el cual ejercerá su futura actividad como ingeniero a fin que su conocimiento tenga en cuenta la realidad social, económica, política y cultural.\n\nOBJETIVOS ESPECÍFICOS\n1. Exponer y comprender las diferentes causas que motivan el grado de atraso de sociedad colombiana.\n2. Presentar sistemáticamente las principales tendencias que guían el pensamiento colombiano en materia de objetivos de desarrollo y superación de la brecha de pobreza.\n Debatir los principales problemas estructurales y coyunturales del desarrollo colombiano.\n4. Disponer de diferentes temáticas que le permitan a través de su análisis comprender diferentes aspectos que condicionan el grado de avance social, cultural, técnico, político y económico de la realidad colombiana, y relacionarlos con su quehacer como futuro ingeniero.",
    "Competencias":"BASICAS\nComprender los problemas de su entorno, y desarrollar con capacidad soluciones lógicas y estructuradas.\nReconocer el significado e importancia de los conceptos derivados de su formación en ingeniería y su aplicación con propiedad en la sociedad.\nFortalecer su valor como persona y comprender su relación con los otros respetando la dignidad de la persona.\nAdquirir competencias de análisis, síntesis, comparación, argumentación, inducción, deducción, capacidad de observación, formulación de hipótesis, de graduación cualitativa, honestidad intelectual, etc., en los procesos de aprendizaje, reflexión e investigación en su formación como ingeniero.\nEl estudiante deberá ser capaz de preguntarse el porqué y el para qué de la realidad cotidiana, identificando problemas y proponiendo soluciones y planes de acción.\nLos principios básicos de su formación, le permitirán comprender e interpretar los distintos fenómenos sociales y el aporte de soluciones.\n\nLABORALES\nAdemás, de las propias competencias de su carrera, el curso servirá para lograr una visión integradora de conocimientos que le permitirá en su vida profesional comprender, participar y actuar en la problemática expuesta.\nParticipará activamente en equipos multidisciplinarios y será capaz de trabajar como ingeniero portando soluciones acordes con el contexto internacional.",
    "Metodologia":"Los temas se desarrollan mediante conferencias magistrales y lecturas seleccionadas para la discusión en clase. Las discusiones se realizan mediante la técnica de un seminario dirigido destinado a permitir interactuar y argumentar por el estudiante sobre los diferentes problemas planteados. En este contexto se seleccionarán estudiantes quienes expondrán temas específicos definidos y señalados en la bibliografía referencial por el profesor correspondiendo a los estudiantes del curso participar en las exposiciones y debates. Se empleara algún material audiovisual para ilustrar los problemas de la sociedad colombiana. \n Igualmente se propone el trabajo en la metodología del Proyecto de Aula entendido este como el “conjunto de actividades que combinando recursos humanos, materiales, financieros y técnicos, se realizan con el propósito de apoyar, complementar y ampliar los programas y el currículo, de una clase o un curso. Es una estrategia metodológica que tiene por propósito principal movilizar las estructuras cognoscitivas del estudiante en un proceso autónomo e interactivo. Dentro de esta estrategia pedagógica el Aula de clase es considerada un sistema de comunicación dinámico e interactivo. Un espacio de socialización y construcción de saberes. El PA es una estrategia pedagógica que vincula: Los objetivos de la pedagogía activa, el cambio conceptual, la formación autónoma, la interacción docente- estudiante para la generación de conocimiento, la autogestión del conocimiento y el constructivismo. \n La función de un PA es: dirigir, encauzar, guiar, orientar sistemática y organizadamente a estudiantes hacia un fin determinado. El PA permite la globalización e integración de aprendizajes fundamentales como el: aprender a ser, aprender a conocer, aprender a convivir y aprender a hacer. Contextualiza y adapta los objetivos a las necesidades e intereses de los estudiantes. Facilita el establecimiento de relaciones con otras áreas del conocimiento (interdisciplinariedad). Se puede evaluar de una forma compartida todas las fases de un proceso, permite el desarrollo de competencias comunicativas y promueve la capacidad investigativa.\n Las motivaciones para la realización de un PA deben ser la de satisfacer una necesidad; resolver un problema de conocimiento; introducir y orientar procesos de cambio y mejorar una actividad o servicio.",
 

    "Semestre": "2",
    "Malla Renglon": "9",
    "Código del Espacio": "8",
    "Espacio Académico": "Historia y Cultura Colombiana",
    "Teórico": "X",
    "Teórico-práctico": "",
    "Práctico": "",
    "Número de Créditos": "2",
    "Horas Trabajo Directo": "2",
    "Horas Trabajo Colaborativo": "2",
    "Horas Trabajo Autónomo": "2",
    "Obligatorio": "X",
    "Básico": "",
    "Complementario": "X",
    "Electivo": "",
    "Intríseco": "",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
    "Contenidos y Unidades Temáticas":"Unidad 1: Antecedentes y Desarrollo Histórico - Social Colombiano.\nUnidad 2: Crecimiento y desarrollo Colombiano.\nUnidad 3: Globalización.\nUnidad 4: Cultura y contexto.",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "En cuanto a los aspectos a evaluar en el curso, se considerarán los siguientes puntos clave. Primero, se realizará una evaluación del desempeño docente para asegurar la calidad del proceso educativo. Luego, se llevará a cabo una evaluación exhaustiva de los aprendizajes de los estudiantes, abordando dimensiones como el desempeño individual y grupal, así como los aspectos teóricos y prácticos, además de la expresión oral y escrita. El proceso incluirá tanto la autoevaluación por parte de los estudiantes como la coevaluación, llevada a cabo de manera oral entre los estudiantes y el docente. En cuanto al tipo de evaluación, se dividirá en varias notas a lo largo del curso, cada una correspondiente a una unidad específica. La primera nota abarcará la Unidad 1 sobre Antecedentes, seguida por la segunda nota para la Unidad 2 sobre Crecimiento y Desarrollo, la tercera nota para la Unidad 3 sobre Globalización y la cuarta nota para la Unidad 4 sobre Cultura y Contexto, asignando porcentajes respectivos. Finalmente, se llevará a cabo un examen final que comprenderá una evaluación de las unidades y seguirá el formato tipo ECAES, contribuyendo al 30% del puntaje total.",

    "Resultados de Aprendizaje1":"Comprender los problemas de su entorno, y desarrollar con capacidad soluciones lógicas y estructuradas.",
    "Resultados de Aprendizaje2":"Reconocer el significado e importancia de los conceptos derivados de su formación en ingeniería y su aplicación con propiedad en la sociedad.",
    "Resultados de Aprendizaje3":"Comprender los procesos de aprendizaje, reflexión e investigación en su formación como ingeniero.",
  
    "Materiales de Estudio": "En el curso se utilizarán diversas fuentes bibliográficas que contribuirán al desarrollo de los contenidos. Algunas de estas referencias incluyen obras como El poder político en Colombia de Fernando Guillén Martínez, publicada por Editorial Punta de Lanza en Bogotá, D. E. Colombia en 1979. También se empleará Ensayos de la historia social de Jaime Jaramillo Uribe, publicado en Santafé de Bogotá, Colombia, en 1994. Otros textos relevantes son Historia económica de Colombia de José Antonio Ocampo, publicado por TM Editores y Fedesarrollo en Santafé de Bogotá, Colombia, en 1997, así como El humanismo crítico latinoamericano de Oscar Mejía Quintana, publicado por M & T Editores en Santafé de Bogotá, Colombia, en 1993. Además, se utilizará Cultura y democracia en América Latina de Oscar Mejía Quintana y Arlene B Tickner, publicado por M & T Editores en Santafé de Bogotá, Colombia, en 1992. Otros textos complementarios abarcan La reforma educativa en Colombia de Eduardo Aldana V y Piedad Caballero P, publicado por Preal - Instituto Ser de Investigación en Santafé de Bogotá, Colombia, en 1997, así como Culturas híbridas de Néstor García Canclini, publicado por Grijalbo en México, D. F. en 1990, y Colombia frente a la globalización de Ricardo Mosquera Mesa, publicado por la Universidad Nacional de Colombia - Icfes en Santafé de Bogotá, D. C. Colombia, en 2000. También se empleará Cómo hacer que funcione la globalización de E. Joseph Stiglitz, publicado por Taurus en Madrid, España, en 2006. Estas obras proporcionarán una base integral para el análisis y la reflexión en el curso."
}