{
    
    "Proyecto curricular": " Ingenieria Electronica",
    "Plan de Estudios": "",
    "Nombre del docente": "",
    "Justificacion Del Espacio": " Las Cátedras, en el contexto de la Universidad, se entienden como espacios académicos de naturaleza interdisciplinaria, organizadas como un conjunto de conferencias, paneles, mesas redondas, simposios, entre otros, desde los cuales se abordan determinadas temáticas o problemáticas con miras a la formación integral de los estudiantes. La Cátedra Francisco José de Caldas se constituye como un encuentro de experiencias académicas y profesionales, de conocimientos, investigaciones y creaciones de individuos, colectivos de investigación y grupos de trabajo de carácter intra e inter Facultades, Proyectos Curriculares y unidades académicas de la Universidad Distrital, que se articulan alrededor de una propuesta coherente con los principios de un Proyecto de Universidad. En ese sentido, la Cátedra Francisco José de Caldas como espacio académico transversal, compartido institucionalmente por todas las Facultades, se justifica por principios que orientan el Proyecto Universitario Institucional, en los cuales la universidad se asume como proyecto cultural que a través del ejercicio de sus funciones sustantivas, aporta a la comprensión y transformación de sí misma y de las realidades sociales y culturales en la perspectiva de la construcción y desarrollo de un proyecto de nación. Se ha dicho sobre el sentido y el lugar de nuestra institución que “La Universidad tiene un espacio asignado en la necesidad de interpretar la cultura mediante su acceso a otras interpretaciones o a través de sus propias investigaciones con el propósito de hacer el mejor uso de ella asimilándola o transformándola. La Universidad es universalización del saber, pero también es contextualización, es interpretación y creación de saberes, es laboratorio, taller, aplicación y por lo tanto, es propuesta y respuesta para los interrogantes y las exigencias de la sociedad en general, de la ciudad y de la región...” Sin duda el elevado lugar que aquí se le da a la Universidad debe estar acompañado de su capacidad de comunicación y trabajo en conjunto con el entorno humano, social, institucional y natural, con el reconocimiento de las diferencias y la capacidad de interactuar con la diversidad cultural. Las relaciones entre la tradición y las propuestas y actividades presentes que contribuyen a la configuración de la identidad universitaria, se hacen visibles en el espacio de la Cátedra Francisco José de Caldas, en la perspectiva de construir y reconstruir su memoria histórica para valorar su pasado, asumir desde una perspectiva ética, crítica y propositiva el presente, y entender y proyectar su papel en la construcción de futuro.",
    "Objetivos":" OBJETIVO GENERAL \n Generar conocimiento y promover la reflexión sobre la formación universitaria a través de la docencia, la investigación, la creación, la gestión y la proyección social y ética en la Universidad, como institución garante del derecho a la educación superior pública de calidad.\n\nOBJETIVOS ESPECIFICOS \n1. Generar conocimiento y promover la reflexión sobre la formación universitaria a través de la docencia, la investigación, la creación, la gestión y la proyección social y ética en la Universidad, como institución garante del derecho a la educación superior pública de calidad.\n\n1. Situar a la comunidad educativa frente a la necesidad de conocer y comprender los problemas globales contemporáneos, sus repercusiones y dimensiones locales y las responsabilidades académicas que se derivan de los mismos.\n2. Propiciar la reflexión académica y crítica que identifica a la cultura académica frente a la responsabilidad social y cultural como miembros de la Universidad Distrital, en el contexto de la ciudad y la nación.\n3. Aportar a la constitución de un proyecto de identidad y formación universitaria que contribuya a la configuración de una sociedad más justa y coherente con sus propios valores.\n4. Reconocer la naturaleza académica e investigativa de la Universidad Distrital, su relación con la formación, actualización, gestión e investigación desde las ciencias, las humanidades, la educación, las ingenierías, las tecnologías, las artes en relación con los retos sociales, humanos y ambientales del entorno.\n5. Desarrollar a través de la Cátedra la conciencia de la necesidad de pertenecer a las comunidades académicas e investigativas de la ciudad y el país, de la región latinoamericana y del mundo, mediante distintos vínculos y relaciones de intercambio y colaboración de saberes y conocimientos con ellas.",
    "Competencias":"1.Se espera que a través del curso el estudiante domine e interprete el lenguaje matemático, y desarrolle competencias genéricas instrumentales que le permitan diseñar, resolver y expresar situaciones que se presentan en su vida cotidiana y en el entorno profesional.\n2. Se espera que a través del curso, el estudiante domine e interprete el lenguaje matemático y desarrolle competencias genéricas instrumentales que le permitan diseñar, resolver y expresar situaciones que se presentan en su vida cotidiana y en el entorno profesional.\n3. Define, interpreta y conceptualiza la función para representar situaciones de modelado por medio de lenguaje matemático y la representación gráfica de la misma.\n4. Utiliza medios computacionales como un medio en la comprensión del concepto de límite para analizar y entender la continuidad y la diferenciabilidad.\n5. Comprende el concepto de diferenciabilidad como una razón de cambio instantáneo, para modelar fenómenos físicos que involucren problemáticas concretas.\n6.Relaciona los conocimientos adquiridos del cálculo diferencial con las ciencias básicas para resolver problemas relacionados con variación o cambio.",
    "Metodologia":"La Cátedra Francisco José de Caldas se configura por orientaciones propuestas por el Comité Institucional de Currículo y definidas por el Consejo Académico Universitario y la Vicerrectoría Académica. Por su naturaleza y sentido, la Cátedra Francisco José de Caldas es un espacio académico abierto y diseñado para los estudiantes que recién ingresan a la Universidad, por lo cual se recomienda programarla para el primer semestre de vinculación a la Universidad y en todo caso durante los tres primeros semestres.\nLa Oficina Asesora de Sistemas es la dependencia administrativa que informa a los Proyectos Curriculares el número de grupos de Cátedra habilitados para abrir en cada semestre. Cada Proyecto Curricular inicia el proceso de inscripción de la Cátedra como un espacio académico con un número no mayor a cuarenta (40) estudiantes. La organización de los grupos de estudiantes de Cátedras está condicionada a los horarios de las franjas establecidas institucionalmente. Iniciado el periodo académico, el estudiante tiene la posibilidad de reorganizar o ajustar su horario de franja de acuerdo con sus necesidades y la disponibilidad de cupo en cada franja según el sistema.",
    
    
    
    "Semestre": "1",
    "Malla Renglon": "9",
    "Código del Espacio": "4",
    "Espacio Académico": "Cátedra Francisco José de Caldas",
    "Teórico": "X",
    "Teórico-práctico": "",
    "Práctico": "",
    "Número de Créditos": "1",
    "Horas Trabajo Directo": "2",
    "Horas Trabajo Colaborativo": "0",
    "Horas Trabajo Autónomo": "1",
    "Obligatorio": "X",
    "Básico": "",
    "Complementario": "X",
    "Electivo": "",
    "Intríseco": "",
    "Extrínseco": "",
    "Clase magistral": "",
    "Seminario": "",
    "Seminario-Taller": "",
    "Taller": "",
    "Prácticas": "",
    "Proyectos con tutoría": "",
    "Conocimientos previos del curso": "Expresión oral y escrita",
    "Prerrequisitos": "",
    "Es prerrequisito de": "",
    "Habilidades y Resultados de Aprendizaje": {
        "Col_1a": {
            "col2a": {
                "col3a": [
                    "col4a",
                    "col4b"
                ],
                "col3c": [
                    "col4c",
                    "col4d",
                    "col4e"
                ],
                "col3f": [
                    "col4f"
                ]
            },
            "col2g": {
                "col3g": [
                    "col4g",
                    "col4h"
                ],
                "col3i": [
                    "col4i",
                    "col4j"
                ]
            }
        },
        "Col_1k": {
            "col2k": {
                "col3k": [
                    "col4k",
                    "col4l"
                ],
                "col3m": [
                    "col4m",
                    "col4n",
                    "col4o"
                ]
            },
            "col2p": {
                "col3p": [
                    "col4p",
                    "col4q"
                ],
                "col3r": [
                    "col4r",
                    "col4s",
                    "col4t"
                ]
            }
        }
    },
     "Contenidos y Unidades Temáticas": "● Unidad 1: Naturaleza y sentido de la universidad distrital y sus relaciones esenciales con la vida y los contextos local, intercultural, universal y global\n● Unidad 2: Compromiso de la Universidad con el conocimiento y comprensión de las realidades de nuestro entorno humano, social y natural (Ciudad y Nación) y el carácter de su participación en la solución de sus problemáticas.\n● Unidad 3: La Universidad Distrital y el carácter académico de su posición, de su voz y su participación pública y de sus propuestas para el mejoramiento de la vida personal, social, cultural y ambiental de la Ciudad Región y del país.",
    "Enfoque de Aprendizaje y Enseñanza": "",
    "Plan de Evaluaciones": "",
    "Resultados de Aprendizaje1":"1.Identificar las funciones misionales de la Universidad Distrital Francisco José de Caldas y su papel dentro de la sociedad.",
    "Resultados de Aprendizaje2":"Reconocer los orígenes y particularidades de la Universidad Distrital Francisco José de Caldas.",
    "Resultados de Aprendizaje3":"3.Describir la estructura orgánica y gubernativa de la Universidad Distrital Francisco José de Caldas, ubicando su papel de estudiante dentro de la comunidad con derechos, deberes, reconocimientos y sanciones. ",
    "Resultados de Aprendizaje4":"4. Identificar su identidad como miembro de la Universidad Distrital alrededor de la figura del prócer Francisco José de Caldas.",
    
    "Materiales de Estudio":"Serway - Jewett, Física para Ciencias e Ingeniería, Vol. II. Editorial Thomson, sexta edición.\nSears-Zemansky, Física Universitaria, Vol. II, Editorial Addison-Wesley, 12a Edición\nTEXTOS COMPLEMENTARIOS\nFishbane, Gasiorowicz & Thortnton, Physics for Scientists & Engineers, Second Edition\nFeynman, R., Lecturas de Física\nSears, F., Física\nHalliday, Resnick, Walter, Fundamentos de Física. Volumen 2. Sexta edición. Ed. Cecsa\nDouglas C. Giancoli, Physics: Principles with applications. 5th ed.\nJohn D. Cutnell & Kenneth W. Johnson, Physics, 4th ed."
}
